<?php

//4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
//
//Написать функцию транслитерации строк.

function trans($slovo) {
    $alphabet = ["a" => "a","б" => "b","в" => "v","г" => "g","д" => "d","е" => "e","ё" => "yo","ж" => "ze","з" => "z","и" => "i","й" => "ii","к" => "k","л" => "l","м" => "m","н" => "n","о" => "o","п" => "p","р" => "r","с" => "s","т" => "t","у" => "u","ф" => "f","х" => "h","ц" => "ce","ч" => "ch","ш" => "sh","щ"=>"shya","ъ" => "","ь" => "","ы" => "ii","э" => "e","ю" => "u","я" => "ya"];
    return strtr(mb_strtolower($slovo), $alphabet);
}

echo trans("Куку");